hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
/**
 * @file modem.c
 *
 * @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
 * @date 2026
 * @copyright GNU General Public License v3
 * @see https://github.com/hiperiondev/esp32idf_APRS
 *
 * @note
 * This is based on other projects:
 *     VP-Digi: https://github.com/sq8vps/vp-digi
 *     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
 *     LibAPRS: https://github.com/markqvist/LibAPRS
 *
 *     please contact their authors for more information.
 *
 * @brief AFSK/FSK modulator and demodulator core implementation: tone
 * generation, filtering and correlation demodulation, DCD, bit recovery and the
 * parallel demodulator instances shared by every supported modem profile.
 */

#include <math.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "esp_attr.h"
#include "esp_log.h"

#include "afsk.h"
#include "ax25.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "modem.h"

static const char *TAG = "modem";

/*
 * Configuration for PLL-based data carrier detection.
 * 1. MAXPULSE - maximum value of the DCD pulse counter. Higher values give more
 *    stability once a correct signal is detected, but delay the DCD release.
 * 2. THRES - threshold of the DCD pulse counter. When reached, the input signal
 *    is assumed valid. Higher values mean more noise immunity but a slower DCD set.
 * 3. The MAXPULSE/THRES difference sets the DCD "inertia".
 * 4. INC is added when a symbol change happens near PLL counter zero.
 * 5. DEC is subtracted when a symbol change happens too far from zero.
 * 6. TUNE is the PLL counter tuning coefficient.
 *
 * [       DCD OFF    *      |    DCD ON   ]
 * 0               COUNTER THRES        MAXPULSE
 *        <-DEC INC->
 */
#define DCD1200_MAXPULSE 60
#define DCD1200_THRES    20
#define DCD1200_INC      2
#define DCD1200_DEC      1
#define DCD1200_TUNE     0.74f

#define DCD9600_MAXPULSE 60
#define DCD9600_THRES    40
#define DCD9600_INC      1
#define DCD9600_DEC      1
#define DCD9600_TUNE     0.74f

#define DCD300_MAXPULSE 80
#define DCD300_THRES    20
#define DCD300_INC      4
#define DCD300_DEC      1
#define DCD300_TUNE     0.74f

#define N1200 8  /* samples per symbol @ fs=9600 */
#define N9600 8  /* samples per symbol @ fs=76800 */
#define N300  32 /* samples per symbol @ fs=9600 */
#define NMAX  32 /* keep equal to the biggest Nx */

/* Every Nx is a samples-per-symbol count, so the PLL step must be 2^32 / Nx.
 *
 * N9600 was 1 (a zero step: dem->pll never advanced and decode() never sampled,
 * so the profile could not decode a single bit by construction), then 4, which
 * at least ran. 4 was still wrong, and it is the whole reason G3RUH sat at 3/5
 * frames while every AFSK profile did 5/5.
 *
 * 4 samples per symbol does not give this timing-recovery design enough to work
 * with. The DPLL's sample instant is quantised to one ADC sample - 25 % of a
 * symbol at N=4 - and the majority vote in decode() spans three of them, i.e.
 * 75 % of a symbol, so the vote window necessarily reaches into a transition.
 * Measured on the host against the real modulator, with the analogue path and
 * both real clocks modelled and no noise at all: at N=4 the profile produces
 * hard bit errors at the sampling phases where the ADC instants coincide with
 * the DAC's update instants (2/8, 4/8 and 6/8 of a symbol), 1.4 % to 2.7 % BER
 * at those phases and 0 % between them. Since the DAC (38461.5 Hz) and the ADC
 * differ by ~0.05 %, the alignment walks through the bad phases every ~55 ms,
 * and a 350 ms transmission crosses them repeatedly. Hence "random" frame loss
 * of roughly 40 %, immune to every amount of TX jitter reduction.
 *
 * At N=8 - the same 8 samples per symbol the 1200 Bd profile has always had,
 * obtained by running the ADC at 76800 Hz - the same simulation gives ZERO bit
 * errors at every sampling phase and with up to 30 us of TX edge jitter. Nothing
 * else about the demodulator changes; it stops being starved of resolution.
 *
 * The vote window and the DPLL tune constants were both swept on the host first:
 * (win=3, shift=0) is already the best of its family and the tune surface is
 * chaotic (some settings collapse to 48 % BER), which is itself a sign the loop
 * is bistable at N=4. There is no tuning fix, only a resolution fix. */
#define PLL1200_STEP ((int32_t)(uint32_t)(((uint64_t)1 << 32) / N1200))
#define PLL9600_STEP ((int32_t)(uint32_t)(((uint64_t)1 << 32) / N9600))
#define PLL300_STEP  ((int32_t)(uint32_t)(((uint64_t)1 << 32) / N300))

/*
 * ADC/DAC clock-ratio calibration.
 *
 * PLLxxxx_STEP above assumes samples-per-symbol is exactly Nxxx, which is
 * only true if the ADC and DAC really run at the nominal
 * MODEM_ADC_SAMPLERATE / MODEM_DAC_SAMPLERATE ratio. They do not: each is
 * an independent hardware timer with its own rounding error against the rate
 * it was configured for (see the MODEM_ADC_SAMPLERATE comment in
 * modem_config.h and dac_timer_create() in afsk.c), and the gap between the
 * two is a steady-state phase error every DPLL in this file has to track for
 * the rest of a transmission. That is the residual, repeatable loss the
 * G3RUH stress test in afsk_loopback_test.c measures: real samples-per-symbol
 * is off from the nominal 8 by a small, fixed amount, and left uncorrected
 * the DPLL has to fight the same known bias, transmission after
 * transmission, instead of being told about it once.
 *
 * sampleRateCorrection is that bias, expressed as (real samples-per-symbol) /
 * (nominal samples-per-symbol). Both clocks are derived from the same
 * crystal, so this ratio is a fixed board property - see
 * ModemCalibrateSampleRate() for the derivation and how it is measured.
 * Default 1.0 (no correction) until ModemCalibrateSampleRate() has been
 * called at least once.
 */
static float sampleRateCorrection = 1.0f;

/**
 * @brief Apply the calibrated ADC/DAC clock ratio to a nominal PLL step.
 *
 * nominalStep = 2^32 / N assumes exactly N samples per symbol. The real
 * count is N * sampleRateCorrection, so the real step is the nominal one
 * divided by the same factor.
 */
static int32_t calibratedPllStep(int32_t nominalStep) {
    double step = (double)(uint32_t)nominalStep / (double)sampleRateCorrection;

    /* Guard the extremes: a step of 0 would never overflow the PLL counter
     * (decode() would never sample a symbol, exactly the N9600=1
     * comment above this block documents), and a step above 2^32-1 cannot be
     * represented at all. Both would require sampleRateCorrection to be
     * wildly out of range, which ModemCalibrateSampleRate() rejects,
     * but this keeps the arithmetic itself well-defined regardless. */
    if (step < 1.0)
        step = 1.0;
    if (step > 4294967295.0)
        step = 4294967295.0;

