hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
/* ------------------------------------------------------------------ */

struct ModemDemodConfig ModemConfig;

/* Note on the ModemInit() vs MODEM_DECODE() race.
 *
 * ModemInit() memsets demodState[] and then reassigns each filter's
 * coeffs/taps piecemeal, while MODEM_DECODE() may be reading that same state
 * from the RX task on another core.
 *
 * What serialises this is afskSetModem(), which suspends the RX task
 * across the ModemInit() call. Any other caller of ModemInit() must do the
 * same. A spinlock would be the wrong tool anyway: portENTER_CRITICAL masks
 * interrupts up to level 3 on this core, which is exactly how the DAC sample
 * clock got starved and every AX.25 frame destroyed - see the ring buffer
 * notes in afsk.c. */

static uint8_t N;             /* samples per symbol */
static uint8_t demodCount;    /* number of parallel demodulators */
static uint8_t currentSymbol; /* current symbol for NRZI encoding */
static uint8_t scrambledSymbol;

float markFreq;
float spaceFreq;
float baudRate;

static uint32_t markStep;  /* Q32 phase increment per DAC sample */
static uint32_t spaceStep; /* Q32 phase increment per DAC sample */
static uint16_t baudRateStep;
static int16_t coeffHiI[NMAX], coeffLoI[NMAX], coeffHiQ[NMAX], coeffLoQ[NMAX];
static uint8_t dcd = 0;

/*
 * G3RUH scrambler state. TX and RX must have one each.
 *
 * A single shared `lfsr` was enough for a half duplex node, which is never
 * scrambling and descrambling at the same moment. It is fatal in full duplex -
 * which is the only mode the loopback self test can run in - because the DAC
 * ISR advances the register once per transmitted symbol while the RX task
 * advances it once per received symbol, from the same variable. Neither
 * register then holds the sequence its own side needs and nothing decodes.
 * They are logically two independent shift registers and are now two
 * variables.
 */
static uint32_t txLfsr = 0x1FFFF;
static uint32_t rxLfsr = 0x1FFFF;

/** BPF with 2200 Hz tone 6 dB preemphasis (it attenuates the 1200 Hz tone by 6 dB) */
static const int16_t bpf1200[8] = { 728, -13418, -554, 19493, -554, -13418, 728, 2104 };

/** BPF with 2200 Hz tone 6 dB deemphasis */
static const int16_t bpf1200Inv[8] = { -10513, -10854, 9589, 23884, 9589, -10854, -10513, -879 };

/* fs=9600, rectangular, fc1=1500, fc2=1900, 0 dB @ 1600/1800 Hz, N=15, gain 65536 */
static const int16_t bpf300[15] = {
    186, 8887, 8184, -1662, -10171, -8509, 386, 5394, 386, -8509, -10171, -1662, 8184, 8887, 186,
};

#define BPF_MAX_TAPS 15

/* fs=9600 Hz, raised cosine, fc=300 Hz (BR=600 Bd), beta=0.8, N=14, gain=65536 */
static const int16_t lpf300[14] = {
    4385, 4515, 4627, 4720, 4793, 4846, 4878, 4878, 4846, 4793, 4720, 4627, 4515, 4385,
};

static const int16_t lpf1200[15] = {
    -6128, -5974, -2503, 4125, 12679, 21152, 27364, 29643, 27364, 21152, 12679, 4125, -2503, -5974, -6128,
};

/* fs=76800 Hz, Gaussian, fc ~5000 Hz (-3 dB at 0.53 x baud), N=15, gain=65536.
 *
 * Redesigned with the sample rate, not merely rescaled. The old 9-tap version
 * was specified for fs=38400 and had to go anyway, but the obvious replacement -
 * the same response at twice the rate, which lands on a 15-tap Gaussian with
 * sigma ~3.0 - is NOT the right filter once there are 8 samples per symbol: its
 * impulse response is then long enough relative to a symbol to cost real ISI.
 * Host sweep of sigma against worst-case BER over 8 sampling phases:
 *
 *      sigma 0.8..2.2  ->  0 errors / 7374 bits
 *      sigma 2.4       ->  6
 *      sigma 2.6       -> 12
 *      sigma 2.8..3.0  -> 18   (the naive "same response as before" choice)
 *
 * sigma 2.0 is taken: mid-range, so there is margin on the ISI side, while
 * -3 dB at ~5 kHz is a defensible noise bandwidth for 9600 Bd on air rather than
 * merely whatever passes a noiseless loopback. */
static const int16_t lpf9600[15] = {
    29, 145, 574, 1769, 4245, 7930, 11538, 13076, 11538, 7930, 4245, 1769, 574, 145, 29,
};

#define LPF_MAX_TAPS    15
#define FILTER_MAX_TAPS ((LPF_MAX_TAPS > BPF_MAX_TAPS) ? LPF_MAX_TAPS : BPF_MAX_TAPS)

struct Filter {
    const int16_t *coeffs;
    uint8_t taps;
    int32_t samples[FILTER_MAX_TAPS];
    uint8_t gainShift;
};

struct DemodState {
    uint8_t rawSymbols;  /* raw, unsynchronized symbols */
    uint8_t syncSymbols; /* synchronized symbols */

    enum ModemPrefilter prefilter;
    struct Filter bpf;
    int16_t correlatorSamples[NMAX];
    uint8_t correlatorSamplesIdx;
    struct Filter lpf;

    uint8_t dcd;

    int32_t pll;
    int32_t pllStep;
    int32_t pllLockedTune;
    int32_t pllNotLockedTune;

    int32_t dcdPll;
    uint8_t dcdLastSymbol;
    uint16_t dcdCounter;
    uint16_t dcdMax;
    uint16_t dcdThres;
    uint16_t dcdInc;
    uint16_t dcdDec;
    int32_t dcdTune;

    int16_t peak;
    int16_t valley;
};

static struct DemodState demodState[MODEM_MAX_DEMODULATOR_COUNT];

static void decode(uint8_t symbol, uint8_t demod, uint16_t mV);
static int32_t demodulate(int16_t sample, struct DemodState *dem);

static int32_t filterRun(struct Filter *f, int32_t input) {
    int32_t out = 0;

    for (uint8_t i = f->taps - 1; i > 0; i--)
        f->samples[i] = f->samples[i - 1]; /* shift old samples */

    f->samples[0] = input;
    for (uint8_t i = 0; i < f->taps; i++)
        out += (int32_t)f->coeffs[i] * f->samples[i];

    return out >> f->gainShift;
}

float ModemGetBaudrate(void) {
    return baudRate;
}

uint8_t ModemGetDemodulatorCount(void) {
    return demodCount;
}

uint8_t ModemDcdState(void) {
    return dcd;
}

void ModemGetSignalLevel(uint8_t modem, int8_t *peak, int8_t *valley, uint8_t *level) {
    *peak = (int8_t)((100 * (int32_t)demodState[modem].peak) >> 12);
    *valley = (int8_t)((100 * (int32_t)demodState[modem].valley) >> 12);
    *level = (uint8_t)((100 * (int32_t)(demodState[modem].peak - demodState[modem].valley)) >> 13);
}

enum ModemPrefilter ModemGetFilterType(uint8_t modem) {
    return demodState[modem].prefilter;
}

