hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
static void setDcd(bool state) {
    if (state)
        LED_Status2(0, 255, 0);
    else
        LED_Status2(0, 0, 0);
}

static inline uint8_t descramble(uint8_t in) {
    /* G3RUH descrambling (x^17+x^12+1). Self synchronising: the register only
     * has to see 17 symbols of any signal to be in step, so no init handshake
     * is needed and the initial value below does not matter. */
    uint8_t bit = (uint8_t)(((rxLfsr & 0x10000) > 0) ^ ((rxLfsr & 0x800) > 0) ^ (in > 0));

    rxLfsr <<= 1;
    rxLfsr |= in;
    return bit;
}

/* IRAM_ATTR: called from MODEM_BAUDRATE_TIMER_HANDLER() (DAC GPTimer ISR)
 * whenever ModemConfig.modem == MODEM_9600. Same -Og inlining risk as
 * dac_scale()/sinSample() above - "static inline" is not a guarantee, and an
 * un-inlined static function defaults to flash. This one is gated on exactly
 * the G3RUH path, which is why it can look like a 9600-only problem while
 * 1200 Bd profiles never call it and never show the jitter. descramble()
 * does not need this: it only runs from decode(), which executes in
 * afsk_rx_task task context, not at interrupt level. */
static inline uint8_t IRAM_ATTR scramble(uint8_t in) {
    /* G3RUH scrambling (x^17+x^12+1) */
    uint8_t bit = (uint8_t)(((txLfsr & 0x10000) > 0) ^ ((txLfsr & 0x800) > 0) ^ (in > 0));

    txLfsr <<= 1;
    txLfsr |= bit;
    return bit;
}

void MODEM_DECODE(int16_t sample, uint16_t mVrms) {
    bool partialDcd = false;

    for (uint8_t i = 0; i < demodCount; i++) {
        uint8_t symbol = (demodulate(sample, &demodState[i]) > 0);

        decode(symbol, i, mVrms);
        if (demodState[i].dcd)
            partialDcd = true;
    }

    if (partialDcd) {
        setDcd(true);
        dcd = 1;
    } else {
        setDcd(false);
        dcd = 0;
    }
}

/**
 * @brief Baudrate/DAC handler. NRZI encoding happens here.
 *        Runs in the GPTimer ISR at MODEM_DAC_SAMPLERATE.
 */
static uint32_t phaseAcc = 0; /* Q32: the full sine cycle is 2^32 */
static uint16_t sampleIndex = 0;

uint8_t IRAM_ATTR MODEM_BAUDRATE_TIMER_HANDLER(void) {
    uint8_t sinwave = 0;

    if (sampleIndex == 0) {
        if (Ax25GetTxBit() == 0) /* next bit is 0 -> change symbol (NRZI) */
            currentSymbol ^= 1;
        sampleIndex = baudRateStep;

        /*
         * Scramble exactly once per symbol, here, and hold the result for the
         * whole symbol below. Scrambling must run once per symbol, not once per
         * DAC sample: at 38400 Hz and 9600 Bd, clocking the scrambler on every
         * sample would run it four times per symbol, so the transmitted
         * sequence would not be the G3RUH sequence and the receiver's
         * descrambler - clocked once per symbol - could never match it. The
         * other profiles are unaffected: they are not scrambled.
         */
        if (ModemConfig.modem == MODEM_9600)
            scrambledSymbol = scramble(currentSymbol);
    }

    if (ModemConfig.modem == MODEM_9600) {
        sinwave = scrambledSymbol ? 240 : 20;
    } else {
        /*
         * The phase accumulator is 32 bits wide and the table index is the top
         * 9 of them, with the fraction carried in the low 23 bits. Stepping the
         * TABLE INDEX by an integer instead would quantise the tone to
         * MODEM_DAC_SAMPLERATE / SIN_LEN, i.e. 75 Hz at 38400, which would put
         * Bell 202's 2200 Hz space on step 29 (2175, -1.14 %), V.23's mark at
         * 1275 (-1.92 %) and AFSK300's mark at 1575 (-1.56 %) - off frequency
         * on air as well as in the loopback. Carrying the fraction keeps every
         * tone exact to seven decimal places, and the only residual is the
         * timer's own +0.16 %.
         *
         * The index is still 9 bit, so the table lookup truncates the phase -
         * that is amplitude distortion around -54 dBc, already well under the
         * 8-bit DAC's own noise floor. Frequency is what matters here, and it
         * is exact.
         */
        if (currentSymbol)
            phaseAcc += spaceStep;
        else
            phaseAcc += markStep;

        sinwave = sinSample((uint16_t)((phaseAcc >> 23) & (SIN_LEN - 1)));
    }

    if (sampleIndex > 0)
        sampleIndex--;

    return sinwave;
}

/**
 * @brief Demodulate a received sample.
 * @param sample Received sample, no more than 13 bits
 * @return Current tone (0 or 1)
 */
static int32_t demodulate(int16_t sample, struct DemodState *dem) {
    /* input signal amplitude tracking */
    if (sample >= dem->peak)
        dem->peak += (int16_t)(((int32_t)(AMP_TRACKING_ATTACK * 32768.f) * (int32_t)(sample - dem->peak)) >> 15);
    else
        dem->peak += (int16_t)(((int32_t)(AMP_TRACKING_DECAY * 32768.f) * (int32_t)(sample - dem->peak)) >> 15);

    if (sample <= dem->valley)
        dem->valley -= (int16_t)(((int32_t)(AMP_TRACKING_ATTACK * 32768.f) * (int32_t)(dem->valley - sample)) >> 15);
    else
        dem->valley -= (int16_t)(((int32_t)(AMP_TRACKING_DECAY * 32768.f) * (int32_t)(dem->valley - sample)) >> 15);

    if (ModemConfig.modem != MODEM_9600) {
        if (dem->prefilter != PREFILTER_NONE)
            dem->correlatorSamples[dem->correlatorSamplesIdx++] = (int16_t)filterRun(&dem->bpf, sample);
        else
            dem->correlatorSamples[dem->correlatorSamplesIdx++] = sample;

        dem->correlatorSamplesIdx %= N;

        int32_t outLoI = 0, outLoQ = 0, outHiI = 0, outHiQ = 0;

        for (uint8_t i = 0; i < N; i++) {
            int16_t t = dem->correlatorSamples[(dem->correlatorSamplesIdx + i) % N];
            outLoI += t * coeffLoI[i];
            outLoQ += t * coeffLoQ[i];
            outHiI += t * coeffHiI[i];
            outHiQ += t * coeffHiQ[i];
        }

        outHiI >>= 14;
        outHiQ >>= 14;
        outLoI >>= 14;
        outLoQ >>= 14;

        sample = (int16_t)((abs(outLoI) + abs(outLoQ)) - (abs(outHiI) + abs(outHiQ)));
    }

    /*
     * DCD using a "PLL". The PLL runs nominally at the baudrate; its counter
     * counts up and overflows to a minimal negative value, so it crosses zero
     * in the middle. A tone change should happen near this zero crossing.
     * Changes near zero raise the DCD pulse counter and pull the counter phase
     * towards zero; changes far from zero lower it. Above dcdThres we claim the
     * incoming signal is valid. dcdMax keeps the DCD from getting "sticky".
     */
    dem->dcdPll = (int32_t)((uint32_t)(dem->dcdPll) + (uint32_t)(dem->pllStep));

    if ((sample > 0) != dem->dcdLastSymbol) { /* tone changed */
        if ((uint32_t)abs(dem->dcdPll) < (uint32_t)(dem->pllStep)) {
            dem->dcdCounter += dem->dcdInc;
            if (dem->dcdCounter > dem->dcdMax)
                dem->dcdCounter = dem->dcdMax;
        } else {
            if (dem->dcdCounter >= dem->dcdDec)
                dem->dcdCounter -= dem->dcdDec;
            else
                dem->dcdCounter = 0;
        }

