hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
        dem->dcdPll = (int32_t)(((int64_t)dem->dcdPll * (int64_t)dem->dcdTune) >> PLL_TUNE_BITS);
    }

    dem->dcdLastSymbol = (sample > 0);

    dem->dcd = (dem->dcdCounter > dem->dcdThres) ? 1 : 0;

    /* Return the raw value, not just its sign: callers compare against 0
     * anyway, and the magnitude is what the diagnostics need. */
    return filterRun(&dem->lpf, sample);
}

/**
 * @brief Bit/clock recovery, NRZI decoding, and hand-off to the protocol layer.
 */
static void decode(uint8_t symbol, uint8_t demod, uint16_t mV) {
    struct DemodState *dem = &demodState[demod];

    int32_t previous = dem->pll;

    dem->pll = (int32_t)((uint32_t)(dem->pll) + (uint32_t)(dem->pllStep));

    dem->rawSymbols <<= 1;
    dem->rawSymbols |= (symbol & 1);

    if ((dem->pll < 0) && (previous > 0)) { /* PLL overflow: sample the symbol */
        dem->syncSymbols <<= 1;

        /* take the last three symbols; one is not enough, three work well */
        uint8_t sym = dem->rawSymbols & 0x07;
        if (sym == 0x07 || sym == 0x06 || sym == 0x05 || sym == 0x03)
            sym = 1;
        else
            sym = 0;

        if (ModemConfig.modem == MODEM_9600)
            sym = descramble(sym);

        dem->syncSymbols |= sym;

        /* NRZI decoding: no transition -> 1, transition -> 0 */
        if (((dem->syncSymbols & 0x03) == 0x03) || ((dem->syncSymbols & 0x03) == 0x00))
            Ax25BitParse(1, demod, mV);
        else
            Ax25BitParse(0, demod, mV);
    }

    if (((dem->rawSymbols & 0x03) == 0x02) || ((dem->rawSymbols & 0x03) == 0x01)) {
        if (!dem->dcd) /* PLL not locked - adjust faster */
            dem->pll = (int32_t)(((int64_t)dem->pll * (int64_t)dem->pllNotLockedTune) >> PLL_TUNE_BITS);
        else /* PLL locked - adjust slower */
            dem->pll = (int32_t)(((int64_t)dem->pll * (int64_t)dem->pllLockedTune) >> PLL_TUNE_BITS);
    }
}

void ModemTransmitStart(void) {
    setPtt(true);
    setTransmit(true);
    ESP_LOGD(TAG, "ModemTransmitStart");
}

/**
 * @brief Stop TX and go back to RX.
 *
 * Called from the DAC timer ISR via Ax25GetTxBit(), so it must be ISR safe:
 * it only lowers a flag. AFSK_ServiceTx(), running in the service task, does
 * the actual teardown (stop the timer, park the DAC, release PTT).
 */
void IRAM_ATTR ModemTransmitStop(void) {
    setTransmit(false);
}

bool ModemTxTeardownPending(void) {
    return AFSK_TxTeardownPending();
}

uint8_t IRAM_ATTR ModemSinSample(uint16_t i) {
    return sinSample(i);
}

void ModemGetStepTones(float *mark, float *space) {
    /* Derived from the steps themselves, so this reports what the modulator is
     * really doing rather than what it was asked to do. */
    if (mark)
        *mark = (float)(((double)markStep * (double)MODEM_DAC_SAMPLERATE) / 4294967296.0);
    if (space)
        *space = (float)(((double)spaceStep * (double)MODEM_DAC_SAMPLERATE) / 4294967296.0);
}

void ModemInit(void) {
    memset(demodState, 0, sizeof(demodState));

    if (ModemConfig.modem > MODEM_9600)
        ModemConfig.modem = MODEM_1200;

    if ((ModemConfig.modem == MODEM_1200) || (ModemConfig.modem == MODEM_1200_V23)) {
        demodCount = 2;
        N = N1200;
        baudRate = 1200.f;

        demodState[0].pllStep = calibratedPllStep(PLL1200_STEP);
        demodState[0].pllLockedTune = (int32_t)(PLL1200_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].pllNotLockedTune = (int32_t)(PLL1200_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].dcdMax = DCD1200_MAXPULSE;
        demodState[0].dcdThres = DCD1200_THRES;
        demodState[0].dcdInc = DCD1200_INC;
        demodState[0].dcdDec = DCD1200_DEC;
        demodState[0].dcdTune = (int32_t)(DCD1200_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));

        demodState[1].pllStep = calibratedPllStep(PLL1200_STEP);
        demodState[1].pllLockedTune = (int32_t)(PLL1200_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[1].pllNotLockedTune = (int32_t)(PLL1200_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[1].dcdMax = DCD1200_MAXPULSE;
        demodState[1].dcdThres = DCD1200_THRES;
        demodState[1].dcdInc = DCD1200_INC;
        demodState[1].dcdDec = DCD1200_DEC;
        demodState[1].dcdTune = (int32_t)(DCD1200_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));

        demodState[1].prefilter = PREFILTER_NONE;
        demodState[1].lpf.coeffs = lpf1200;
        demodState[1].lpf.taps = sizeof(lpf1200) / sizeof(*lpf1200);
        demodState[1].lpf.gainShift = 15;

        demodState[0].lpf.coeffs = lpf1200;
        demodState[0].lpf.taps = sizeof(lpf1200) / sizeof(*lpf1200);
        demodState[0].lpf.gainShift = 15;
        demodState[0].prefilter = PREFILTER_NONE;

        if (ModemConfig.flatAudioIn) {
            /* flat audio input: use deemphasis + flat modems */
#ifdef ENABLE_FX25
            if (Ax25Config.fx25)
                demodState[0].prefilter = PREFILTER_NONE;
            else
#endif
                demodState[0].prefilter = PREFILTER_DEEMPHASIS;
            demodState[0].bpf.coeffs = bpf1200Inv;
            demodState[0].bpf.taps = sizeof(bpf1200Inv) / sizeof(*bpf1200Inv);
            demodState[0].bpf.gainShift = 15;
        } else {
            /* normal (filtered) audio input: use flat + preemphasis modems */
            demodState[0].prefilter = PREFILTER_PREEMPHASIS;
            demodState[0].bpf.coeffs = bpf1200;
            demodState[0].bpf.taps = sizeof(bpf1200) / sizeof(*bpf1200);
            demodState[0].bpf.gainShift = 15;
        }

        if (ModemConfig.modem == MODEM_1200) { /* Bell 202 */
            markFreq = 1200.f;
            spaceFreq = 2200.f;
        } else { /* V.23 */
            markFreq = 1300.f;
            spaceFreq = 2100.f;
        }
    } else if (ModemConfig.modem == MODEM_300) {
        demodCount = 1;
        N = N300;
        baudRate = 300.f;
        markFreq = 1600.f;
        spaceFreq = 1800.f;

        demodState[0].pllStep = calibratedPllStep(PLL300_STEP);
        demodState[0].pllLockedTune = (int32_t)(PLL300_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].pllNotLockedTune = (int32_t)(PLL300_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].dcdMax = DCD300_MAXPULSE;
        demodState[0].dcdThres = DCD300_THRES;
        demodState[0].dcdInc = DCD300_INC;
        demodState[0].dcdDec = DCD300_DEC;
        demodState[0].dcdTune = (int32_t)(DCD300_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));

        demodState[0].prefilter = PREFILTER_FLAT;
        demodState[0].bpf.coeffs = bpf300;
        demodState[0].bpf.taps = sizeof(bpf300) / sizeof(*bpf300);
        demodState[0].bpf.gainShift = 16;
        demodState[0].lpf.coeffs = lpf300;
        demodState[0].lpf.taps = sizeof(lpf300) / sizeof(*lpf300);
        demodState[0].lpf.gainShift = 15;
    } else if (ModemConfig.modem == MODEM_9600) {
        demodCount = 1;
        N = N9600;
        baudRate = 9600.f;

