hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
        /*
         * G3RUH is baseband NRZ, not AFSK: there are no mark and space tones,
         * so both are reported as 0. MODEM_DAC_SAMPLERATE is what configures
         * the timer; the tone-reporting helpers must not claim a mark or space
         * frequency for a profile that emits neither.
         */
        markFreq = 0.f;
        spaceFreq = 0.f;

        demodState[0].pllStep = calibratedPllStep(PLL9600_STEP);
        demodState[0].pllLockedTune = (int32_t)(PLL9600_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].pllNotLockedTune = (int32_t)(PLL9600_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].dcdMax = DCD9600_MAXPULSE;
        demodState[0].dcdThres = DCD9600_THRES;
        demodState[0].dcdInc = DCD9600_INC;
        demodState[0].dcdDec = DCD9600_DEC;
        demodState[0].dcdTune = (int32_t)(DCD9600_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));

        demodState[0].prefilter = PREFILTER_NONE;
        /* Receive only, despite what this comment said for a long time. Nothing
         * on the TX path runs it - MODEM_BAUDRATE_TIMER_HANDLER() emits a raw
         * 240/20 square - and it should stay that way: shaping the transmitter
         * with this same filter was tried on the host and roughly doubles the
         * BER, because the TX+RX cascade closes the eye. If transmit shaping is
         * ever wanted it needs its own, wider filter and its own state (the
         * receiver is using this instance concurrently in full duplex). */
        demodState[0].lpf.coeffs = lpf9600;
        demodState[0].lpf.taps = sizeof(lpf9600) / sizeof(*lpf9600);
        demodState[0].lpf.gainShift = 16;
    }

    /* Q32 phase increment: step = f * 2^32 / Fs, rounded. Exact to ~1e-7 %. */
    markStep = (uint32_t)(((double)markFreq * 4294967296.0) / (double)MODEM_DAC_SAMPLERATE + 0.5);
    spaceStep = (uint32_t)(((double)spaceFreq * 4294967296.0) / (double)MODEM_DAC_SAMPLERATE + 0.5);
    baudRateStep = (uint16_t)(MODEM_DAC_SAMPLERATE / (uint32_t)baudRate);

    {
        float txMark = 0, txSpace = 0;
        ModemGetStepTones(&txMark, &txSpace);
        ESP_LOGI(TAG, "mark %.1f Hz -> emits %.2f, space %.1f Hz -> emits %.2f, baudRateStep %u, rate correction %+.3f%%", markFreq, txMark, spaceFreq, txSpace,
                 baudRateStep, (double)((sampleRateCorrection - 1.0f) * 100.0f));
    }

    for (uint8_t i = 0; i < N; i++) { /* correlator coefficients */
        coeffLoI[i] = (int16_t)(4095.f * cosf(2.f * 3.1416f * (float)i / (float)N * markFreq / baudRate));
        coeffLoQ[i] = (int16_t)(4095.f * sinf(2.f * 3.1416f * (float)i / (float)N * markFreq / baudRate));
        coeffHiI[i] = (int16_t)(4095.f * cosf(2.f * 3.1416f * (float)i / (float)N * spaceFreq / baudRate));
        coeffHiQ[i] = (int16_t)(4095.f * sinf(2.f * 3.1416f * (float)i / (float)N * spaceFreq / baudRate));
    }

    /* reset the modulator state */
    phaseAcc = 0;
    sampleIndex = 0;
    currentSymbol = 0;
    scrambledSymbol = 0;
    txLfsr = 0x1FFFF;
    rxLfsr = 0x1FFFF;
    dcd = 0;
}
